[Survived] BlockStatement
main/components/Courses/CoursesTable.js:12:40
 
      const navigate = useNavigate();
 
-     const idClickCallback = (cell) => {
-        navigate(`/courses/${cell.row.values.id}`);
-    };
+     const idClickCallback = (cell) => {};
 
      const joinCallback = (cell) => {

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:17:18
     };
 
      const joinCallback = (cell) => {
-        navigate(`/courses/join/${cell.row.values.id}`);
+        navigate(``);
     };
 
killedBy: UserTable tests Join button navigates to the join page for a user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/join/1"
Received: ""

Number of calls: 1

<html>

[Killed] ArrowFunction
main/components/Courses/CoursesTable.js:44:19
         {
             Header: 'id',
             accessor: 'id',
-            Cell: ({ cell }) => (
-                <a 
-                    href={`/courses/${cell.value}`}
-                    onClick={(e) => {
-                        e.preventDefault(); 
-                        idClickCallback(cell);
-                    }}
-                    style={{ cursor: "pointer", color: "#007bff", textDecoration: "underline" }}
-                >
-                    {cell.value}
-                </a>
-            )
+            Cell: () => undefined
         },
          {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] BlockStatement
main/components/Courses/CoursesTable.js:47:37
             Cell: ({ cell }) => (
                 <a 
                     href={`/courses/${cell.value}`}
-                    onClick={(e) => {
-                        e.preventDefault(); 
-                        idClickCallback(cell);
-                    }}
+                    onClick={(e) => {}}
                     style={{ cursor: "pointer", color: "#007bff", textDecoration: "underline" }}
                 >

[Survived] StringLiteral
main/components/Courses/CoursesTable.js:51:56
                         e.preventDefault(); 
                         idClickCallback(cell);
                     }}
-                    style={{ cursor: "pointer", color: "#007bff", textDecoration: "underline" }}
+                    style={{ cursor: "pointer", color: "", textDecoration: "underline" }}
                 >
                     {cell.value}

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:86:45
      ];
 
      if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
+         columns.push(ButtonColumn("Staff", "", staffCallback, "CoursesTable"));
          columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
killedBy: UserTable tests Has the expected colum headers and content for instructorUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:87:69
 
      if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
          columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
+         columns.push(ButtonColumn("Edit", "primary", editCallback, ""));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
      }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:98:62
      return (
         <>
             <div>Total Courses: {courses.length}</div>
-          <OurTable data={courses} columns={columns} testid={"CoursesTable"} />
+          <OurTable data={courses} columns={columns} testid={""} />
         </>
       );
killedBy: CourseIndexPage tests renders three courses correctly for admin
statusReason: Error: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
