[Killed] ObjectLiteral
src/main/pages/CoursesShowPage.js:17:13
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/courses?id=${id}`],
 
-            { // Stryker disable next-line all : GET is the default
-                method: "GET", url: "/api/courses/get",
-                params: {
-                    id
-                },
-            },
+            {},
     []
         );
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: Error: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
src/main/pages/CoursesShowPage.js:19:25
 
             { // Stryker disable next-line all : GET is the default
                 method: "GET", url: "/api/courses/get",
-                params: {
-                    id
-                },
+                params: {},
             },
     []
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: Error: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] EqualityOperator
src/main/pages/CoursesShowPage.js:26:12
     []
         );
     let allowed;
-        if(courses.length !== 0){
+        if(courses.length === 0){
             allowed = [courses]
         }
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: TypeError: data.forEach is not a function

[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:26:33
     []
         );
     let allowed;
-        if(courses.length !== 0){
-            allowed = [courses]
-        }
+        if(courses.length !== 0){}
         else{
             allowed = courses;
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:29:13
         if(courses.length !== 0){
             allowed = [courses]
         }
-        else{
-            allowed = courses;
-        }
+        else{}
 
     return (
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: TypeError: Cannot read properties of undefined (reading 'length')
