[Killed] ConditionalExpression
src/main/pages/CoursesShowPage.js:27:12
     []
         );
     let allowed;
-        if(courses.length !== 0){
+        if(false){
             allowed = [courses]
         }
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: TypeError: data.forEach is not a function

[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:36:45
 
         const [file, setFile] = useState(null);
 
-        const handleFileChange = (event) => {
-            setFile(event.target.files[0]);
-        };
+        const handleFileChange = (event) => {};
 
         const { mutate: uploadRoster } = useBackendMutation(
killedBy: CoursesShowPage tests calls mutation on upload click
statusReason: TypeError: _reactToastify.toast.error is not a function

[Survived] ArrowFunction
src/main/pages/CoursesShowPage.js:41:13
         };
 
         const { mutate: uploadRoster } = useBackendMutation(
-            (data) => ({
-                url: "/api/students/upload/egrades",
-                method: "POST",
-                data: data,
-                params: { courseId: id },
-            }),
+            () => undefined,
             {
                 onSuccess: () => {

[Survived] ObjectLiteral
src/main/pages/CoursesShowPage.js:41:24
         };
 
         const { mutate: uploadRoster } = useBackendMutation(
-            (data) => ({
-                url: "/api/students/upload/egrades",
-                method: "POST",
-                data: data,
-                params: { courseId: id },
-            }),
+            (data) => ({}),
             {
                 onSuccess: () => {

[Survived] StringLiteral
src/main/pages/CoursesShowPage.js:42:22
 
         const { mutate: uploadRoster } = useBackendMutation(
             (data) => ({
-                url: "/api/students/upload/egrades",
+                url: "",
                 method: "POST",
                 data: data,

[Survived] BlockStatement
src/main/pages/CoursesShowPage.js:48:34
                 params: { courseId: id },
             }),
             {
-                onSuccess: () => {
-                    toast.success("Roster uploaded successfully!");
-                },
+                onSuccess: () => {},
                 onError: () => {
                     toast.error("Error uploading roster. Please try again.");

[Survived] BlockStatement
src/main/pages/CoursesShowPage.js:51:32
                 onSuccess: () => {
                     toast.success("Roster uploaded successfully!");
                 },
-                onError: () => {
-                    toast.error("Error uploading roster. Please try again.");
-                },
+                onError: () => {},
             }
         );

[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:57:36
             }
         );
 
-        const handleUpload = () => {
-            if (file) {
-                const formData = new FormData();
-                formData.append("file", file);
-                uploadRoster(formData);
-            } else {
-                toast.error("Please select a file to upload.");
-            }
-        };    
+        const handleUpload = () => {};    
 
     return (
killedBy: CoursesShowPage tests calls mutation on upload click
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<FormData>

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
src/main/pages/CoursesShowPage.js:58:23
         );
 
         const handleUpload = () => {
-            if (file) {
-                const formData = new FormData();
-                formData.append("file", file);
-                uploadRoster(formData);
-            } else {
+            if (file) {} else {
                 toast.error("Please select a file to upload.");
             }
killedBy: CoursesShowPage tests calls mutation on upload click
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<FormData>

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
src/main/pages/CoursesShowPage.js:58:17
         );
 
         const handleUpload = () => {
-            if (file) {
+            if (false) {
                 const formData = new FormData();
                 formData.append("file", file);
killedBy: CoursesShowPage tests calls mutation on upload click
statusReason: TypeError: _reactToastify.toast.error is not a function

[Killed] StringLiteral
src/main/pages/CoursesShowPage.js:60:33
         const handleUpload = () => {
             if (file) {
                 const formData = new FormData();
-                formData.append("file", file);
+                formData.append("", file);
                 uploadRoster(formData);
             } else {
killedBy: CoursesShowPage tests calls uploadRoster with correct parameters on file upload
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {}
Received: null

[Survived] BlockStatement
src/main/pages/CoursesShowPage.js:62:20
                 const formData = new FormData();
                 formData.append("file", file);
                 uploadRoster(formData);
-            } else {
-                toast.error("Please select a file to upload.");
-            }
+            } else {}
         };    
 
