[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:46:15
 
           <Nav className="me-auto">
             {
-              (hasRole(currentUser, "ROLE_USER")) && (
-                <>
-                  <Nav.Link href="/courses">Courses</Nav.Link>
-                  <Nav.Link href="/schools">Schools</Nav.Link>
-                </>
-              )
+              false
             }
           </Nav>
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Courses. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
