[Killed] ConditionalExpression
main/components/Users/UsersTable.js:36:53
     const toggleAdminCallback = async (cell) => {
         const userGithubLogin = cell.row.values.githubLogin;
         
-        if (currentUser?.root?.user?.githubLogin && userGithubLogin === currentUser.root.user.githubLogin) {
+        if (currentUser?.root?.user?.githubLogin && true) {
             if (promptResponse !== currentUser.root.user.githubLogin) {
killedBy: AdminUsersPage tests user table toggle admin tests for another user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to toggle the admin status for this user?"

Number of calls: 0

<html>
  <head />

[Killed] EqualityOperator
main/components/Users/UsersTable.js:36:53
     const toggleAdminCallback = async (cell) => {
         const userGithubLogin = cell.row.values.githubLogin;
         
-        if (currentUser?.root?.user?.githubLogin && userGithubLogin === currentUser.root.user.githubLogin) {
+        if (currentUser?.root?.user?.githubLogin && userGithubLogin !== currentUser.root.user.githubLogin) {
             if (promptResponse !== currentUser.root.user.githubLogin) {
killedBy: AdminUsersPage tests user table toggle admin tests for another user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to toggle the admin status for this user?"

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:38:17
         
         if (currentUser?.root?.user?.githubLogin && userGithubLogin === currentUser.root.user.githubLogin) {
-            if (promptResponse !== currentUser.root.user.githubLogin) {
+            if (false) {
                 alert("Confirmation failed. Admin status not changed.");
                 return;
killedBy: AdminUsersPage tests user table toggle admin tests for current user with incorrect confirmation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Confirmation failed. Admin status not changed."

Number of calls: 0

[Killed] BlockStatement
main/components/Users/UsersTable.js:38:71
         
         if (currentUser?.root?.user?.githubLogin && userGithubLogin === currentUser.root.user.githubLogin) {
-            if (promptResponse !== currentUser.root.user.githubLogin) {
-                alert("Confirmation failed. Admin status not changed.");
-                return;
-            }
+            if (promptResponse !== currentUser.root.user.githubLogin) {}
             toggleAdminMutation.mutate(cell);
         }
killedBy: AdminUsersPage tests user table toggle admin tests for current user with incorrect confirmation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Confirmation failed. Admin status not changed."

Number of calls: 0

[Killed] StringLiteral
main/components/Users/UsersTable.js:39:23
         if (currentUser?.root?.user?.githubLogin && userGithubLogin === currentUser.root.user.githubLogin) {
             if (promptResponse !== currentUser.root.user.githubLogin) {
-                alert("Confirmation failed. Admin status not changed.");
+                alert("");
                 return;
             }
killedBy: AdminUsersPage tests user table toggle admin tests for current user with incorrect confirmation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Confirmation failed. Admin status not changed."
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/components/Users/UsersTable.js:44:13
             }
             toggleAdminMutation.mutate(cell);
         }
-        else{
-            if (window.confirm("Are you sure you want to toggle the admin status for this user?")) {
-                toggleAdminMutation.mutate(cell);
-            }
-        }
+        else{}
     };
     // toggleInstructor
killedBy: AdminUsersPage tests user table toggle admin tests for another user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to toggle the admin status for this user?"

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:45:17
             toggleAdminMutation.mutate(cell);
         }
         else{
-            if (window.confirm("Are you sure you want to toggle the admin status for this user?")) {
+            if (true) {
                 toggleAdminMutation.mutate(cell);
             }
killedBy: AdminUsersPage tests user table toggle admin tests for another user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to toggle the admin status for this user?"

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:45:17
             toggleAdminMutation.mutate(cell);
         }
         else{
-            if (window.confirm("Are you sure you want to toggle the admin status for this user?")) {
+            if (false) {
                 toggleAdminMutation.mutate(cell);
             }
killedBy: AdminUsersPage tests user table toggle admin tests for another user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to toggle the admin status for this user?"

Number of calls: 0

<html>
  <head />
