[Killed] ConditionalExpression
main/components/Users/UsersTable.js:34:13
     const toggleAdminCallback = async (cell) => {
         const userGithubLogin = cell.row.values.githubLogin;
         
-        if (currentUser?.root?.user?.githubLogin && userGithubLogin === currentUser.root.user.githubLogin) {
+        if (false) {
             if (promptResponse !== currentUser.root.user.githubLogin) {
killedBy: AdminUsersPage tests user table toggle admin tests for current user with correct confirmation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "WARNING! You are toggling admin status for yourself. Once you remove your own admin privileges you will not be able to give them back to yourself and will need another admin to give you privileges back. Please type your GitHub login to confirm:"

Number of calls: 0

<html>
  <head />

[Killed] EqualityOperator
main/components/Users/UsersTable.js:36:17
         
         if (currentUser?.root?.user?.githubLogin && userGithubLogin === currentUser.root.user.githubLogin) {
-            if (promptResponse !== currentUser.root.user.githubLogin) {
+            if (promptResponse === currentUser.root.user.githubLogin) {
                 alert("Confirmation failed. Admin status not changed.");
                 return;
killedBy: AdminUsersPage tests user table toggle admin tests for current user with correct confirmation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
